<body>
   <!-- navbarPost -->
   <nav class="animated fadeIn navbar fixed-top navbar-light bg-light">
  <a class="ellip navbar-brand nav2" href="#/!">
   <i class="fas fa-sm fa-arrow-left"></i><span class="span"> Go back</span>
  </a>
      <a value="Reload Page" onClick="document.location.reload(true)">
        <i class="fas fa-sync-alt fa-1x"></i>       
      </a> 
    </nav><!-- /navbarPost -->
<div class="content-title"><h3>Quranic duas</h3></div>
<div class="animated fadeIn container">
     <div class="content-date">
    <ul class="list-inline">
      <li class="list-inline-item">
        <span>
          <i class="fas fa-1x fa-calendar">
          </i> May 28, 2018
        </span>
      </li>
      <li class="list-inline-item">
        <a href="https://www.facebook.com/dialog/feed?app_id=333246047199259&link=https%3A%2F%2Falessandraaruby.github.io%2Fblog%2F%23!quranicdua&picture=https%3A%2F%2Falessandraaruby.github.io%2Fblog%2Fcontents%2Fquranic-duas%2Fimage.jpg&name=Quranic%20Duas&caption=%20&description=Check%20out%2038%20useful%20duas%20or%20supplications%20from%20the%20Quran.&redirect_uri=https%3A%2F%2Falessandraaruby.github.io%2Fblog%2F%23!quranicdua">
          <i class="far fa-share-square fa-1x"></i> Share on Facebook
        </a>
      </li>
    </ul>
</div>
        <!-- featured post img -->
      <div class="featured-post">
        <img class="img-fluid" src="/blog/html/contents/quranic-dua/image.jpg"/>
      </div>
   <div class="content-post">
<p>Dua #1</p>

<p>&#1575;&#1614;&#1593;&#1615;&#1608;&#1618;&#1584;&#1615; &#1576;&#1616;&#1575;&#1604;&#1604;&#1607;&#1616; &#1575;&#1614;&#1606;&#1618; &#1575;&#1614;&#1603;&#1615;&#1608;&#1618;&#1606;&#1614; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1580;&#1648;&#1607;&#1616;&#1604;&#1616;&#1610;&#1618;&#1606;&#1614;</p>

<p>'I seek refuge in Allah from being among Al-Jahilun (the ignorant or the foolish).' (Al-Baqarah:67)</p>

<p>Dua #2</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1578;&#1614;&#1602;&#1614;&#1576;&#1617;&#1614;&#1604;&#1618; &#1605;&#1616;&#1606;&#1617;&#1614;&#1570; &#1750; &#1573;&#1616;&#1606;&#1617;&#1614;&#1603;&#1614; &#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1616;&#1610;&#1618;&#1593;&#1615; &#1575;&#1604;&#1618;&#1593;&#1614;&#1604;&#1616;&#1610;&#1618;&#1605;&#1615; &#1758; &#1608;&#1614;&#1578;&#1615;&#1576;&#1618; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1606;&#1614;&#1570; &#1750; &#1573;&#1616;&#1606;&#1617;&#1614;&#1603;&#1614; &#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1575;&#1604;&#1578;&#1617;&#1614;&#1608;&#1617;&#1614;&#1575;&#1576;&#1615; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1618;&#1605;&#1615;</p>

<p>'O our Lord! Accept (this service) from us. Verily! You are the All-Hearer, the All-Knower and accept our repentance. Truly, You are the One who Accepts repentance, the Most Merciful.' (Al-Baqarah: 127-128)</p>

<p>Dua #3</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1570; &#1575;&#1648;&#1578;&#1616;&#1606;&#1614;&#1575; &#1601;&#1616;&#1609;&#1618; &#1575;&#1604;&#1583;&#1617;&#1615;&#1606;&#1618;&#1610;&#1614;&#1575; &#1581;&#1614;&#1587;&#1614;&#1606;&#1614;&#1577;&#1611; &#1608;&#1617;&#1614;&#1601;&#1616;&#1609;&#1618; &#1575;&#1604;&#1618;&#1575;&#1648;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1581;&#1614;&#1587;&#1614;&#1606;&#1614;&#1577;&#1611; &#1608;&#1617;&#1614;&#1602;&#1616;&#1606;&#1614;&#1575; &#1593;&#1614;&#1584;&#1614;&#1575;&#1576;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1585;&#1616; &#1758;</p>

<p>'O our Lord! Give us good in this world, and good in the Hereafter, and save us from the torment of the Fire!' (Al-Baqarah: 201)</p>

<p>Dua #4</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1570; &#1575;&#1614;&#1601;&#1618;&#1585;&#1616;&#1594;&#1618; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1606;&#1614;&#1575; &#1589;&#1614;&#1576;&#1618;&#1585;&#1611;&#1575; &#1608;&#1617;&#1614;&#1579;&#1614;&#1576;&#1617;&#1616;&#1578;&#1618; &#1575;&#1614;&#1602;&#1618;&#1583;&#1614;&#1575;&#1605;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1575;&#1606;&#1618;&#1589;&#1615;&#1585;&#1618;&#1606;&#1614;&#1575; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1602;&#1614;&#1608;&#1618;&#1605;&#1616; &#1575;&#1604;&#1618;&#1603;&#1648;&#1601;&#1616;&#1585;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>'O our Lord! Pour forth on us patience, and Set firm our feet and help us (to be victorious) over the disbelieving people.' (Al-Baqarah: 250)</p>

<p>Dua #5</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1604;&#1614;&#1575; &#1578;&#1615;&#1572;&#1614;&#1575;&#1582;&#1616;&#1584;&#1618;&#1606;&#1614;&#1570; &#1575;&#1616;&#1606;&#1618; &#1606;&#1617;&#1614;&#1587;&#1616;&#1610;&#1618;&#1606;&#1614;&#1570; &#1575;&#1614;&#1608;&#1618; &#1575;&#1614;&#1582;&#1618;&#1591;&#1614;&#1575;&#1618;&#1606;&#1614;&#1575; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1604;&#1614;&#1575; &#1578;&#1614;&#1581;&#1618;&#1605;&#1616;&#1604;&#1618; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1606;&#1614;&#1570; &#1575;&#1616;&#1589;&#1618;&#1585;&#1611;&#1575; &#1603;&#1614;&#1605;&#1614;&#1575; &#1581;&#1614;&#1605;&#1614;&#1604;&#1618;&#1578;&#1614;&#1607;&#1615;&#1765; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1618;&#1606;&#1614; &#1605;&#1616;&#1606;&#1618; &#1602;&#1614;&#1576;&#1618;&#1604;&#1616;&#1606;&#1614;&#1575; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1604;&#1614;&#1575; &#1578;&#1615;&#1581;&#1614;&#1605;&#1617;&#1616;&#1604;&#1618;&#1606;&#1614;&#1575; &#1605;&#1614;&#1575; &#1604;&#1614;&#1575; &#1591;&#1614;&#1575;&#1602;&#1614;&#1577;&#1614; &#1604;&#1614;&#1606;&#1614;&#1575; &#1576;&#1616;&#1607;&#1616;&#1766; &#1608;&#1614;&#1575;&#1593;&#1618;&#1601;&#1615; &#1593;&#1614;&#1606;&#1617;&#1614;&#1575; &#1608;&#1614;&#1575;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1575;&#1585;&#1618;&#1581;&#1614;&#1605;&#1618;&#1606;&#1614;&#1570; &#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1605;&#1614;&#1608;&#1618;&#1604;&#1648;&#1646;&#1606;&#1614;&#1575; &#1601;&#1614;&#1575;&#1606;&#1618;&#1589;&#1615;&#1585;&#1618;&#1606;&#1614;&#1575; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1602;&#1614;&#1608;&#1618;&#1605;&#1616; &#1575;&#1604;&#1618;&#1603;&#1648;&#1601;&#1616;&#1585;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>'O our Lord! Punish us not if we forget or fall into error, O our Lord! Lay not on us the burden like that which You did lay on those before us. O our Lord! Put not on us the burden greater than we have strength to bear. Pardon us and grant us forgiveness, and have mercy on us. You are our Maula (Supporter, Protector, Patron, Sustainer) so give us victory over the disbelievers.' (Al-Baqarah: 286)</p>

<p>Dua #6</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1604;&#1614;&#1575; &#1578;&#1615;&#1586;&#1616;&#1594;&#1618; &#1602;&#1615;&#1604;&#1615;&#1608;&#1618;&#1576;&#1614;&#1606;&#1614;&#1575; &#1576;&#1614;&#1593;&#1618;&#1583;&#1614; &#1573;&#1616;&#1584;&#1618; &#1607;&#1614;&#1583;&#1614;&#1610;&#1618;&#1578;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1607;&#1614;&#1576;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1605;&#1616;&#1606; &#1604;&#1617;&#1614;&#1583;&#1615;&#1606;&#1618;&#1603;&#1614; &#1585;&#1614;&#1581;&#1618;&#1605;&#1614;&#1577;&#1611; &#1754; &#1573;&#1616;&#1606;&#1617;&#1614;&#1603;&#1614; &#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1575;&#1604;&#1618;&#1608;&#1614;&#1607;&#1617;&#1614;&#1575;&#1576;&#1615; &#1758;</p>

<p>'O our Lord! Let not our hearts deviate (from the truth) after You have Guided us, and Grant us mercy from You. Truly, You are the Bestower.' (Al-Imran: 8)</p>

<p>Dua #7</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1570; &#1573;&#1616;&#1606;&#1617;&#1614;&#1606;&#1614;&#1570; &#1575;&#1648;&#1605;&#1614;&#1606;&#1617;&#1614;&#1575; &#1601;&#1614;&#1575;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1584;&#1615;&#1606;&#1615;&#1608;&#1618;&#1576;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1602;&#1616;&#1606;&#1614;&#1575; &#1593;&#1614;&#1584;&#1614;&#1575;&#1576;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1585;&#1616; &#1758;</p>

<p>'O our Lord! Indeed we believed, so forgive us our sins and save us from the punishment of the Fire.' (Al-Imran: 16)</p>

<p>Dua #8</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1570; &#1575;&#1648;&#1605;&#1614;&#1606;&#1617;&#1614;&#1575; &#1576;&#1616;&#1605;&#1614;&#1570; &#1575;&#1614;&#1606;&#1618;&#1586;&#1614;&#1604;&#1618;&#1578;&#1614; &#1608;&#1614;&#1575;&#1578;&#1617;&#1614;&#1576;&#1614;&#1593;&#1618;&#1606;&#1614;&#1575; &#1575;&#1604;&#1585;&#1617;&#1614;&#1587;&#1615;&#1608;&#1618;&#1604;&#1614; &#1601;&#1614;&#1575;&#1603;&#1618;&#1578;&#1615;&#1576;&#1618;&#1606;&#1614;&#1575; &#1605;&#1614;&#1593;&#1614; &#1575;&#1604;&#1588;&#1617;&#1648;&#1607;&#1616;&#1583;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>'O our Lord! We believe in what You have sent down, and we follow the Messenger, so write us among those who bear witness.' (Al-Imran: 53)</p>

<p>Dua #9</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1575;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1584;&#1615;&#1606;&#1615;&#1608;&#1618;&#1576;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1573;&#1616;&#1587;&#1618;&#1585;&#1614;&#1575;&#1601;&#1614;&#1606;&#1614;&#1575; &#1601;&#1616;&#1609;&#1618; &#1575;&#1614;&#1605;&#1618;&#1585;&#1616;&#1606;&#1614;&#1575; &#1608;&#1614;&#1579;&#1614;&#1576;&#1617;&#1616;&#1578;&#1618; &#1575;&#1614;&#1602;&#1618;&#1583;&#1614;&#1575;&#1605;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1575;&#1606;&#1618;&#1589;&#1615;&#1585;&#1618;&#1606;&#1614;&#1575; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1602;&#1614;&#1608;&#1618;&#1605;&#1616; &#1575;&#1604;&#1618;&#1603;&#1648;&#1601;&#1616;&#1585;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>'O our Lord! Forgive us our sins and our transgressions (in keeping our duties), and make firm our feet, and give us victory over the disbelieving people.' (Al-Imran: 147)</p>

<p>Dua #10</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1592;&#1614;&#1604;&#1614;&#1605;&#1618;&#1606;&#1614;&#1570; &#1575;&#1614;&#1606;&#1618;&#1601;&#1615;&#1587;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1573;&#1616;&#1606;&#1618; &#1604;&#1617;&#1614;&#1605;&#1618; &#1578;&#1614;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1578;&#1614;&#1585;&#1618;&#1581;&#1614;&#1605;&#1618;&#1606;&#1614;&#1575; &#1604;&#1614;&#1606;&#1614;&#1603;&#1615;&#1608;&#1618;&#1606;&#1614;&#1606;&#1617;&#1614; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1582;&#1614;&#1575;&#1587;&#1616;&#1585;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>'O our Lord! We have wronged ourselves. And if You Forgive us not, and Bestow not upon us Your Mercy, we shall certainly be from the losers.' (Al-Araf: 23)</p>

<p>Dua #11</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1570; &#1575;&#1614;&#1601;&#1618;&#1585;&#1616;&#1594;&#1618; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1606;&#1614;&#1575; &#1589;&#1614;&#1576;&#1618;&#1585;&#1611;&#1575; &#1608;&#1617;&#1614;&#1578;&#1614;&#1608;&#1614;&#1601;&#1617;&#1614;&#1606;&#1614;&#1575; &#1605;&#1615;&#1587;&#1618;&#1604;&#1616;&#1605;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;O our Lord! Pour on us patience, and cause us to die as Muslims.&raquo; (Al-Araf: 126)</p>

<p>Dua #12</p>

<p>&#8206;&#1581;&#1614;&#1587;&#1618;&#1576;&#1616;&#1609;&#1614; &#1575;&#1604;&#1604;&#1607;&#1615; &#1604;&#1614;&#1570; &#1573;&#1616;&#1604;&#1648;&#1607;&#1614; &#1573;&#1616;&#1604;&#1617;&#1614;&#1575; &#1607;&#1615;&#1608;&#1614; &#1750; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1607;&#1616; &#1578;&#1614;&#1608;&#1614;&#1603;&#1617;&#1614;&#1604;&#1618;&#1578;&#1615; &#1750; &#1608;&#1614;&#1607;&#1615;&#1608;&#1614; &#1585;&#1614;&#1576;&#1617;&#1615; &#1575;&#1604;&#1618;&#1593;&#1614;&#1585;&#1618;&#1588;&#1616; &#1575;&#1604;&#1618;&#1593;&#1614;&#1592;&#1616;&#1610;&#1618;&#1605;&#1616; &#1758;</p>

<p>&laquo;Allah is sufficient for me. None has the right to be worshiped but He, in Him I put trust and He is the Lord of the Mighty Throne.&raquo; (At-Tawbah: 129)</p>

<p>Dua #13</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1604;&#1614;&#1575; &#1578;&#1614;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618;&#1606;&#1614;&#1575; &#1601;&#1616;&#1578;&#1618;&#1606;&#1614;&#1577;&#1611; &#1604;&#1617;&#1616;&#1604;&#1618;&#1602;&#1614;&#1608;&#1618;&#1605;&#1616; &#1575;&#1604;&#1592;&#1617;&#1614;&#1575;&#1604;&#1616;&#1605;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758; &#1608;&#1614;&#1606;&#1614;&#1580;&#1617;&#1616;&#1606;&#1614;&#1575; &#1576;&#1616;&#1585;&#1614;&#1581;&#1618;&#1605;&#1614;&#1578;&#1616;&#1603;&#1614; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1602;&#1614;&#1608;&#1618;&#1605;&#1616; &#1575;&#1604;&#1618;&#1603;&#1648;&#1601;&#1616;&#1585;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;O our Lord! Make us not a trial for the people who are Zalimeen (unjust and wrong doers) (i.e. Do not make them overpower us). And save us by Your Mercy from the disbelieving people.&raquo; (Yunus: 85-86)</p>

<p>Dua #14</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1616;&#1606;&#1617;&#1616;&#1609;&#1618; &#1575;&#1614;&#1593;&#1615;&#1608;&#1618;&#1584;&#1615; &#1576;&#1616;&#1603;&#1614; &#1575;&#1614;&#1606;&#1618; &#1575;&#1614;&#1587;&#1618;&#1600;&#1620;&#1614;&#1604;&#1614;&#1603;&#1614; &#1605;&#1614;&#1575; &#1604;&#1614;&#1610;&#1618;&#1587;&#1614; &#1604;&#1616;&#1609;&#1618; &#1576;&#1616;&#1607;&#1616;&#1766; &#1593;&#1616;&#1604;&#1618;&#1605;&#1612; &#1608;&#1614;&#1575;&#1616;&#1604;&#1617;&#1614;&#1575; &#1578;&#1614;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1616;&#1609;&#1618; &#1608;&#1614;&#1578;&#1614;&#1585;&#1618;&#1581;&#1614;&#1605;&#1618;&#1606;&#1616;&#1609;&#1618; &#1575;&#1614;&#1603;&#1615;&#1606;&#1618; &#1605;&#1617;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1582;&#1648;&#1587;&#1616;&#1585;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;O my Lord! Indeed I seek refuge in You that I ask You of which I have no knowledge. And if you do not forgive me and have mercy on me, indeed I will be one of the losers.&raquo; (Hud: 47)</p>

<p>Dua #15</p>

<p>&#8206;&#1601;&#1614;&#1575;&#1591;&#1616;&#1585;&#1614; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1648;&#1608;&#1648;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1618;&#1575;&#1614;&#1585;&#1618;&#1590;&#1616; &#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1608;&#1614;&#1604;&#1616;&#1610;&#1617;&#1616;&#1766; &#1601;&#1616;&#1609;&#1618; &#1575;&#1604;&#1583;&#1617;&#1615;&#1606;&#1618;&#1610;&#1614;&#1575; &#1608;&#1614;&#1575;&#1604;&#1618;&#1575;&#1648;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1578;&#1614;&#1608;&#1614;&#1601;&#1617;&#1614;&#1606;&#1616;&#1609;&#1618; &#1605;&#1615;&#1587;&#1618;&#1604;&#1616;&#1605;&#1611;&#1575; &#1608;&#1617;&#1614;&#1575;&#1614;&#1604;&#1618;&#1581;&#1616;&#1602;&#1618;&#1606;&#1616;&#1609;&#1618; &#1576;&#1616;&#1575;&#1604;&#1589;&#1617;&#1648;&#1604;&#1616;&#1581;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;The Creator of the Heavens and the Earth! You are my Wali (Protector, Helper, Supporter, Guardian, Lord) in this world and in the Hereafter. Cause me to die as a Muslim (the one submitting to Your Will), and join me with the righteous.&raquo; (Yusuf: 101)</p>

<p>Dua #16</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618;&#1606;&#1616;&#1609;&#1618; &#1605;&#1615;&#1602;&#1616;&#1610;&#1618;&#1605;&#1614; &#1575;&#1604;&#1589;&#1617;&#1614;&#1604;&#1648;&#1608;&#1577;&#1616; &#1608;&#1614;&#1605;&#1616;&#1606;&#1618; &#1584;&#1615;&#1585;&#1617;&#1616;&#1610;&#1617;&#1614;&#1578;&#1616;&#1609;&#1618; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1578;&#1614;&#1602;&#1614;&#1576;&#1617;&#1614;&#1604;&#1618; &#1583;&#1615;&#1593;&#1614;&#1570;&#1569;&#1616; &#1758; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1575;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1616;&#1609;&#1618; &#1608;&#1614;&#1604;&#1616;&#1608;&#1614;&#1575;&#1604;&#1616;&#1583;&#1614;&#1609;&#1617;&#1614; &#1608;&#1614;&#1604;&#1616;&#1604;&#1618;&#1605;&#1615;&#1572;&#1618;&#1605;&#1616;&#1606;&#1616;&#1610;&#1618;&#1606;&#1614; &#1610;&#1614;&#1608;&#1618;&#1605;&#1614; &#1610;&#1614;&#1602;&#1615;&#1608;&#1605;&#1615; &#1575;&#1604;&#1618;&#1581;&#1616;&#1587;&#1614;&#1575;&#1576;&#1615; &#1758;</p>

<p>&laquo;O my Lord! Make me one of who performs As-Salat (Iqamat-as-Salat), and (also) from my offspring, O our Lord! And accept my invocation. O our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established.&raquo; (Ibrahim: 40-41)</p>

<p>Dua #17</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1585;&#1618;&#1581;&#1614;&#1605;&#1618;&#1607;&#1615;&#1605;&#1614;&#1575; &#1603;&#1614;&#1605;&#1614;&#1575; &#1585;&#1614;&#1576;&#1617;&#1614;&#1610;&#1614;&#1575;&#1606;&#1616;&#1609;&#1618; &#1589;&#1614;&#1594;&#1616;&#1610;&#1618;&#1585;&#1611;&#1575; &#1758;</p>

<p>&laquo;O my Lord! Bestow on them (my parents) Your Mercy as they brought me up when I was young.&raquo; (Al-Isra: 24)</p>

<p>Dua #18</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1614;&#1583;&#1618;&#1582;&#1616;&#1604;&#1618;&#1606;&#1616;&#1609;&#1618; &#1605;&#1615;&#1583;&#1618;&#1582;&#1614;&#1604;&#1614; &#1589;&#1616;&#1583;&#1618;&#1602;&#1613; &#1608;&#1617;&#1614; &#1575;&#1614;&#1582;&#1618;&#1585;&#1616;&#1580;&#1618;&#1606;&#1616;&#1609;&#1618; &#1605;&#1615;&#1582;&#1618;&#1585;&#1614;&#1580;&#1614; &#1589;&#1616;&#1583;&#1618;&#1602;&#1613; &#1608;&#1617;&#1614;&#1575;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618; &#1604;&#1617;&#1616;&#1609;&#1618; &#1605;&#1616;&#1606;&#1618; &#1604;&#1617;&#1614;&#1583;&#1615;&#1606;&#1618;&#1603;&#1614; &#1587;&#1615;&#1604;&#1618;&#1591;&#1648;&#1606;&#1611;&#1575; &#1606;&#1617;&#1614;&#1589;&#1616;&#1610;&#1618;&#1585;&#1611;&#1575; &#1758;</p>

<p>&laquo;O my Lord! Let my entry be good, and my exit be good. And grant me from You an authority to help me.&raquo; (Al-Isra: 80)</p>

<p>Dua #19</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1570; &#1575;&#1648;&#1578;&#1616;&#1606;&#1614;&#1575; &#1605;&#1616;&#1606;&#1618; &#1604;&#1617;&#1614;&#1583;&#1615;&#1606;&#1618;&#1603;&#1614; &#1585;&#1614;&#1581;&#1618;&#1605;&#1614;&#1577;&#1611; &#1608;&#1617;&#1614;&#1607;&#1614;&#1610;&#1617;&#1616;&#1574;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1605;&#1616;&#1606;&#1618; &#1575;&#1614;&#1605;&#1618;&#1585;&#1616;&#1606;&#1614;&#1575; &#1585;&#1614;&#1588;&#1614;&#1583;&#1611;&#1575; &#1758;</p>

<p>&laquo;O our Lord! Bestow upon us mercy from Yourself, and Facilitate for us our affair in the right way.&raquo; (Al-Kahf: 10)</p>

<p>Dua #20</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1588;&#1618;&#1585;&#1614;&#1581;&#1618; &#1604;&#1616;&#1609;&#1618; &#1589;&#1614;&#1583;&#1618;&#1585;&#1616;&#1609;&#1618; &#1758; &#1608;&#1614;&#1610;&#1614;&#1587;&#1617;&#1616;&#1585;&#1618;&#1604;&#1616;&#1609;&#1618; &#1575;&#1614;&#1605;&#1618;&#1585;&#1616;&#1609;&#1618; &#1758; &#1608;&#1614;&#1575;&#1581;&#1618;&#1604;&#1615;&#1604;&#1618; &#1593;&#1615;&#1602;&#1618;&#1583;&#1614;&#1577;&#1611; &#1762; &#1605;&#1617;&#1616;&#1606;&#1618; &#1604;&#1617;&#1616;&#1587;&#1614;&#1575;&#1606;&#1616;&#1609;&#1618; &#1758; &#1610;&#1614;&#1601;&#1618;&#1602;&#1614;&#1607;&#1615;&#1608;&#1618;&#1575; &#1602;&#1614;&#1608;&#1618;&#1604;&#1616;&#1609;&#1618; &#1758;</p>

<p>&laquo;O my Lord! Open for me my chest (grant me self-confidence, contentment and boldness). And make my task easy for me. And loosen the knot (the defect) from my tongue. That they may understand my speech.&raquo; (Taha: 25-28)</p>

<p>Dua #21</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1586;&#1616;&#1583;&#1618;&#1606;&#1616;&#1609;&#1618; &#1593;&#1616;&#1604;&#1618;&#1605;&#1611;&#1575; &#1758;</p>

<p>&laquo;O my Lord! Increase me in knowledge.&raquo; (Taha: 114)</p>

<p>Dua #22</p>

<p>&#8206;&#1575;&#1614;&#1606;&#1617;&#1616;&#1609;&#1618; &#1605;&#1614;&#1587;&#1617;&#1614;&#1606;&#1616;&#1609;&#1614; &#1575;&#1604;&#1590;&#1617;&#1615;&#1585;&#1617;&#1615; &#1608;&#1614;&#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1575;&#1614;&#1585;&#1618;&#1581;&#1614;&#1605;&#1615; &#1575;&#1604;&#1585;&#1617;&#1648;&#1581;&#1616;&#1605;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;Verily, pain and illness has seized me, and You are the Most Merciful of all those show mercy.&raquo; (Al-Anbiya: 83)</p>

<p>Dua #23</p>

<p>&#8206;&#1604;&#1614;&#1570; &#1575;&#1616;&#1604;&#1648;&#1607;&#1614; &#1575;&#1616;&#1604;&#1617;&#1614;&#1570; &#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1587;&#1615;&#1576;&#1618;&#1581;&#1648;&#1606;&#1614;&#1603;&#1614; &#1575;&#1616;&#1606;&#1617;&#1616;&#1609;&#1618; &#1603;&#1615;&#1606;&#1618;&#1578;&#1615; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1592;&#1617;&#1648;&#1604;&#1616;&#1605;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;None has the right to be worshipped but You (O Allah) Glory be to You [above all that (evil) they associate with You]! Truly, I have been from the wrongdoers.&raquo; (Al-Anbiya: 87)</p>

<p>Dua #24</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1604;&#1614;&#1575; &#1578;&#1614;&#1584;&#1614;&#1585;&#1618;&#1606;&#1616;&#1609;&#1618; &#1601;&#1614;&#1585;&#1618;&#1583;&#1611;&#1575; &#1608;&#1617;&#1614;&#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1582;&#1614;&#1610;&#1618;&#1585;&#1615; &#1575;&#1604;&#1618;&#1608;&#1648;&#1585;&#1616;&#1579;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;O my Lord! Leave me not single (childless), and You are the Best of the inheritors.&raquo; (Al-Anbiya: 89)</p>

<p>Dua #25</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1614;&#1606;&#1618;&#1586;&#1616;&#1604;&#1618;&#1606;&#1616;&#1609;&#1618; &#1605;&#1615;&#1606;&#1618;&#1586;&#1614;&#1604;&#1611;&#1575; &#1605;&#1617;&#1615;&#1576;&#1614;&#1575;&#1585;&#1614;&#1603;&#1611;&#1575; &#1608;&#1617;&#1614;&#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1582;&#1614;&#1610;&#1618;&#1585;&#1615; &#1575;&#1604;&#1618;&#1605;&#1615;&#1606;&#1618;&#1586;&#1616;&#1604;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;O my Lord! Cause me to land at a blessed landing place, and You are the best of those who cause to land.&raquo; (Al-Mu'minun: 29)</p>

<p>Dua #26</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1614;&#1593;&#1615;&#1608;&#1618;&#1584;&#1615; &#1576;&#1616;&#1603;&#1614; &#1605;&#1616;&#1606;&#1618; &#1607;&#1614;&#1605;&#1614;&#1586;&#1648;&#1578;&#1616; &#1575;&#1604;&#1588;&#1617;&#1614;&#1610;&#1648;&#1591;&#1616;&#1610;&#1618;&#1606;&#1616; &#1758; &#1608;&#1614;&#1575;&#1614;&#1593;&#1615;&#1608;&#1618;&#1584;&#1615; &#1576;&#1616;&#1603;&#1614; &#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1614;&#1606;&#1618; &#1610;&#1617;&#1614;&#1581;&#1618;&#1590;&#1615;&#1585;&#1615;&#1608;&#1618;&#1606;&#1616; &#1758;</p>

<p>&laquo;O my Lord! I seek refuge with You from the whisperings (suggestions) of the Shayateen (devils). And I seek refuge with You. My Lord! Lest they should come near me.&raquo; (Al-Mu'minun: 97-98)</p>

<p>Dua #27</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1608;&#1614;&#1575;&#1585;&#1618;&#1581;&#1614;&#1605;&#1618; &#1608;&#1614;&#1575;&#1614;&#1606;&#1618;&#1578;&#1614; &#1582;&#1614;&#1610;&#1618;&#1585;&#1615; &#1575;&#1604;&#1585;&#1617;&#1648;&#1581;&#1616;&#1605;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;O my Lord! Forgive and (show) mercy, and You are the best of those who show mercy.&raquo; (Al-Mu'minun: 118)</p>

<p>Dua #28</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1575;&#1589;&#1618;&#1585;&#1616;&#1601;&#1618; &#1593;&#1614;&#1606;&#1617;&#1614;&#1575; &#1593;&#1614;&#1584;&#1614;&#1575;&#1576;&#1614; &#1580;&#1614;&#1607;&#1614;&#1606;&#1617;&#1614;&#1605;&#1614; &#1750; &#1573;&#1616;&#1606;&#1617;&#1614; &#1593;&#1614;&#1584;&#1614;&#1575;&#1576;&#1614;&#1607;&#1614;&#1575; &#1603;&#1614;&#1575;&#1606;&#1614; &#1594;&#1614;&#1585;&#1614;&#1575;&#1605;&#1611;&#1575; &#1758; &#1573;&#1616;&#1606;&#1617;&#1614;&#1607;&#1614;&#1575; &#1587;&#1614;&#1570;&#1569;&#1614;&#1578;&#1618; &#1605;&#1615;&#1587;&#1618;&#1578;&#1614;&#1602;&#1614;&#1585;&#1617;&#1611;&#1575; &#1608;&#1617;&#1614; &#1605;&#1615;&#1602;&#1614;&#1575;&#1605;&#1611;&#1575; &#1758;</p>

<p>&laquo;O our Lord! Avert from us the torment of Hell. Verily its torment is ever an inseparable, (permanent) punishment. Indeed, it is an evil abode and an evil place to rest (in).&raquo; (Al-Furqan: 65-66)</p>

<p>Dua #29</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1607;&#1614;&#1576;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1605;&#1616;&#1606;&#1618; &#1575;&#1614;&#1586;&#1618;&#1608;&#1614;&#1575;&#1580;&#1616;&#1606;&#1614;&#1575; &#1608;&#1614;&#1584;&#1615;&#1585;&#1617;&#1616;&#1610;&#1617;&#1648;&#1578;&#1616;&#1606;&#1614;&#1575; &#1602;&#1615;&#1585;&#1617;&#1614;&#1577;&#1614; &#1575;&#1614;&#1593;&#1618;&#1610;&#1615;&#1606;&#1613; &#1608;&#1617;&#1614;&#1575;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618;&#1606;&#1614;&#1575; &#1604;&#1616;&#1604;&#1618;&#1605;&#1615;&#1578;&#1617;&#1614;&#1602;&#1616;&#1610;&#1618;&#1606;&#1614; &#1575;&#1616;&#1605;&#1614;&#1575;&#1605;&#1611;&#1575; &#1758;</p>

<p>&laquo;O our Lord! Bestow on us from our spouses and our offspring the comfort and coolness of our eyes, and make us leaders of the Muttaqeen (the pious).&raquo; (Al-Furqan: 74)</p>

<p>Dua #30</p>

<p>&#8206;&#1585;&#1614;&#1576;&#1617;&#1616; &#1607;&#1614;&#1576;&#1618; &#1604;&#1616;&#1609;&#1618; &#1581;&#1615;&#1603;&#1618;&#1605;&#1611;&#1575; &#1608;&#1617;&#1614;&#1575;&#1614;&#1604;&#1618;&#1581;&#1616;&#1602;&#1618;&#1606;&#1616;&#1609;&#1618; &#1576;&#1616;&#1575;&#1604;&#1589;&#1617;&#1648;&#1604;&#1616;&#1581;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758; &#1608;&#1614;&#1575;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618; &#1604;&#1617;&#1616;&#1609;&#1618; &#1604;&#1616;&#1587;&#1614;&#1575;&#1606;&#1614; &#1589;&#1616;&#1583;&#1618;&#1602;&#1613; &#1601;&#1616;&#1609;&#1618; &#1575;&#1604;&#1618;&#1570;&#1582;&#1616;&#1585;&#1616;&#1610;&#1618;&#1606;&#1614; &#1758; &#1608;&#1614;&#1575;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618;&#1606;&#1616;&#1609;&#1618; &#1605;&#1616;&#1606;&#1618; &#1608;&#1617;&#1614;&#1585;&#1614;&#1579;&#1614;&#1577;&#1616; &#1580;&#1614;&#1606;&#1617;&#1614;&#1577;&#1616; &#1575;&#1604;&#1606;&#1617;&#1614;&#1593;&#1616;&#1610;&#1618;&#1605;&#1616; &#1758; &#1608;&#1614;&#1604;&#1614;&#1575; &#1578;&#1615;&#1582;&#1618;&#1586;&#1616;&#1606;&#1616;&#1609;&#1618; &#1610;&#1614;&#1608;&#1618;&#1605;&#1614; &#1610;&#1615;&#1576;&#1618;&#1593;&#1614;&#1579;&#1615;&#1608;&#1618;&#1606;&#1614; &#1758;</p>

<p>&laquo;O my Lord! Bestow Hukm (religious knowledge, right judgement of the affairs, power of decision making) on me, and join me with the righteous. And grant me an honorable mention in the later generations. And make me one of the inheritors of the Paradise of Delight. And disgrace me not on the Day when (all creation) will be resurrected.&raquo; (Ash-Shuara: 83-85,87)</p>
</div>
   </div>

</body>